suspend plantuml remote rendering; convert puml to mermaid
